{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/03/23/hello-world/"}],"tags":[],"categories":[],"pages":[{"title":"个人简历","text":"个人信息 林超群/男/1999 福建省模式识别与图像理解重点实验室 邮箱：990345019@qq.com 联系方式：18850302747 个人主页：https://laplatom.github.io/about/ 研究兴趣：脱机笔迹鉴别、OCR 相关、目标检测与识别、AIGC等。 教育背景 厦门理工学院，计算机技术，硕士，导师：王大寒&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2022.9 - 至今（预计 2025.6 毕业）• 获得 2022 新生奖学金• 获得 2022-2023 学年校二等奖学金 浙江传媒学院，软件工程，本科，导师：王忠、吉娜烨&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2017.9 - 2021.6• 获得 2018-2019 学年《浙报·阿里》二等奖学金• 获得 2019-2020 学年国家励志奖学金• 获得 2020-2021 学年校三等奖学金• 班内担任团支书职位• 任 2019-2020 年浙江传媒学院媒体工程学院 17 网络工程 1、2 班《Java 程序设计》助教职位• 任 2019-2020 年浙江传媒学院媒体工程学院 18 数技（互动方向）《人工智能》助教职位 科研论文林超群, 王大寒*, 肖顺鑫, 池雪可, 王驰明, 张煦尧, 朱顺痣. 基于孪生网络与多重通道融合的脱机笔迹鉴别. 自动化学报, 2024, 50(8): 1660−1670 doi: 10.16383/j.aas.c230777(CCF-A,卓越期刊,中文核心,EI)Chao-Qun Lin, Da-Han Wang*, Yanfei Su, De-wu Ge, Xu-Yao Zhang, OCR4HSV: A Multi-Task Learning Approach for Handwritten Signature Verification. International Conference on Pattern Recognition (ICPR)，2024. (CCF-C) 实习经历 杭州熵基瀚联电子商务有限公司（实习），算法助理工程师，浙江杭州，2021.05 - 2021.09• 描述：负责《基于摄像头的行人目标检测与识别》，从摄像头的行人图片信息入手，实时检测该行人的外部特征。• 我的职责：负责行人的外部特征识别裁剪算法，采用 caffe 对外部特征进行分类，之后转为 YOLO 算法，并在 YOLO 算法进行测试识别。• 成果：本人离职前实现大部分特征均可正常识别，但是在正面双肩包与单肩包检测部分存在问题。 福建电子口岸股份有限公司（实习），算法工程师，福建厦门，2022.01 - 2022.08• 描述：负责“OCR 对接管理平台”的开发，作为管理系统，获取 plc 数据和 OCR 识别结果，控制摄像头做出对应的逻辑操作，最后存入数据库。• 我的职责：通过 Python 进行发包接包，进行 PLC 数据与 OCR 数据的交互，并且以 Django 为后端，Bootstrap 进行前端设计，实现可视化• 成果：基本完成项目，离职前已经在测试。 项目经历 国家级创新创业计划《基于深度学习的路况检测系统的设计与开发》，浙江杭州，2019.04 - 2020.04• 描述：本项目针对城市视频监控网络，研究并设计出一种车辆感知定位框架。项目将从车辆外观特征入手，将车辆的定位问题设计成一个回归网络问题，通过车辆与交通状况的时空关系挖掘，实现监控网络中车辆的快速定位。• 我的职责：基于城市视频监控网络获的城市监控当中的车辆视频图片，以视频车辆图片为基础，结合 YOLOv3 的视频输入模型，设计一款基于 YOLOv3 的智能交通管理系统。• 成果：本项目实现 YOLOv3 网络，并且通过了学校验收。 融合知识图谱的 NBA 赛事新闻的自动写作，浙江杭州，2019.10-2019.10• 描述：本项目提出一种 NBA 赛事新闻的自动生成方法。采用关键事件抽取算法从文字直播数据中抽取事件点、匹配突出关键事件的模板来生成新闻初稿, 再从构建的 NBA 赛事知识图谱中提取背景信息和描述重点, 自动生成最终的新闻稿。• 我的职责：本人主要做了以下工作：1. 代码的重构，把项目代码由 Python2 重新设计为 Python3 代码；2. 知识图谱的维护构建与篮球新闻数据集的整理、维护与发布；• 成果：项目开源在 Github 上：conniemy/BasketballNews、conniemy/BasketballVideo。 浙江省新苗人才计划《基于深度学习的车辆综合特征提取及其在校园车辆管理方面的应用研究》，浙江杭州，2019.11 - 2020.11• 描述：本项目针对校园内共享单车的管理，车辆停放，特殊时期、特殊路段的车辆管理等问题，建立一个校园车辆监测管理系统。该系统可以实时监控校园内车辆情况，一旦发现共享单车违规摆放、车辆违规进入管制区域、车辆乱停放等问题，该系统可即时反馈给校园相关管理人员或者车主，以实现车辆的规范管理。• 我的职责：本项目分为共享单车的识别、车辆综合特征的识别、车辆的入侵检测、车辆违规停放检测四个部分。其中我们通过收集校园内共享单车与行人的图片进行共享单车与行人的检测和特征识别，另外我们通过将 YOLOv3 算法与Deep Sort 算法想结合，以前后三帧作为多目标跟踪的相似度判断，最终实现行人与单车的检测框为中心的轨迹实现。并且以该轨迹为基础，通过人为交互设计违停区域，实现了车辆的入侵检测与违规停放功能。• 成果：1. 本项目在 NVIDIA Jetson TX1 机械上实现了每秒 24 帧的识别效率，达到了实时的效果、2. 本项目作为本人的本科毕设作品 基于 web 输入的联机笔迹鉴别系统，福建厦门，2023.03-2023.04• 描述：本项目提出一种基于 web 输入的联机笔迹鉴别系统。使用者可以通过在 web 上的签字版上通过签五个自己的签名作为系统留底，之后的每一个签名与预留的五个签名进行对比，对比结果的判断率超过设定的阈值（默认为 0.6）即为判断正确。因为该联机系统为基于 web 实现数据的输入，因此本系统在平板、手机、PC 三段均可输入测试• 我的职责：本项目采 web 的 canvas 模块作为输入，获取到联机笔迹点，传到服务器后端转为图像，通过模型与系统保存的模型进行比较。后端由 flask 实现，签名验证模型由自己独自训练的模型来判断。• 成果：笔迹验证准确率达到 80+，项目即将开源在 Github 上。 河南国家电网《表单关键信息提取》，福建厦门，2023.10-2023.12• 描述：导师横向项目。项目的目标为检测、识别、模板匹配、版面分析及矫正、关键信息提取及后处理河南电力系统当中的信息表单文本数据, 用于支撑相应应用场景下的脱机文本表单图片的文字处理相关任务。多个应用场景包括：文字识别、文本行检测、文本行识别、版面分析、关键信息提取及规则判断等。• 我的职责：本项目采用多模型整合而成，当我们拿到表单文档的时候，先通过 PyTorch 的文档矫正算法进行文档矫正，然后中科院 API 和自己基于 Paddle 训练的基于文本行进行 OCR 识别的模型同时进行文本行的检测和识别，将检测识别到的文本信息及位置通过 Paddle 的关键信息提取算法进行训练。• 成果：在 3000+ 测试图片上均取得不错的效果，可构建 api 或基于 docker 的部署，单张图片处理时间小于 1s。 学科竞赛· 2018 年“全国大学生数学建模竞赛”获得浙江赛区三等奖，2018· “浙江省首届大学生网络与信息安全竞赛”获得省级二等奖，2018· “浙江省第二届大学生网络与信息安全竞赛”获得省级二等奖，2019· 第十届国际图象图形学学术会议 ICIG2019“智能交通视频图像增强处理竞赛”获得优秀奖，2019· “浙江省第三届大学生网络与信息安全竞赛”获得省级三等奖，2020· “第十一届蓝桥杯大赛软件赛省赛”获得省级二等奖，2020· “第十四届蓝桥杯大赛软件赛省赛”获得省级三等奖（研究生组），2023 专利信息王大寒，林超群，何一凡，池雪可，朱顺痣，王驰明，于金喜，张选庆，基于孪生网络与多重通道融合的脱机笔迹鉴别方法，申请号：ZL202311797195.2，授权日期：2024.03.12 其他方面 计算机方面：Python，C 可作为工作语言、C++，Java，MATLAB 需要重新熟悉一下、web 前后端开发了解 BootStrap，Flask，Django、掌握 Pytorch 与 Paddle 框架、熟练应用 SQL、Oracle、SQLite 等数据库；对嵌入式系统及 Linux 有一定的了解、已获得计算机三级证书 算法方面：传统数字图像处理算法、数字图像与视频处理、计算机视觉、人工智能相关算法，特别是文本文字相关的检测与识别 个人面貌：中共党员、CAAI 会员 致谢感谢您花时间阅读我的简历，期待能有机会和您共事。","link":"/about/index.html"}]}